In [1]:
import pandas as pd
import numpy as np

In [3]:
df_crop = pd.read_csv("india_crop_recommendation_dataset_extended.csv")

In [5]:
df_crop.head()

     N   P   K  temperature  humidity    ph  rainfall label
0  111  51  57        29.53     89.69  5.50    230.12  rice
1   84  48  40        28.92     71.51  6.74    153.82  rice
2   88  59  59        20.84     82.07  6.59    191.44  rice
3   92  51  40        24.57     86.53  5.72    240.39  rice
4  115  47  50        25.42     88.26  6.71    210.45  rice

In [4]:
df_yield = pd.read_csv("india_crop_yield_dataset_extended.csv")

In [6]:
df_yield.head()

        State       Crop  Season   Area  Annual_Rainfall  Fertilizer  Yield
0   Karnataka    soybean  Kharif  13.76           397.60      335.00  38.07
1  Tamil Nadu  groundnut  Kharif  16.57           771.64      183.50  40.96
2      Punjab  groundnut  Kharif   3.97          1639.01      307.75  49.58
3  Tamil Nadu        tea    Zaid  17.58          2801.45      336.66  60.00
4      Punjab   turmeric    Rabi   5.71           529.96      272.77  44.56

In [8]:
df_crop.shape

(4000, 8)

In [9]:
df_yield.shape

(3000, 7)

In [10]:
df_crop.columns

Index(['N', 'P', 'K', 'temperature', 'humidity', 'ph', 'rainfall', 'label'], dtype='object')

In [11]:
df_yield.columns

Index(['State', 'Crop', 'Season', 'Area', 'Annual_Rainfall', 'Fertilizer',
       'Yield'],
      dtype='object')

In [12]:
df_crop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 8 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   N            4000 non-null   int64
 1   P            4000 non-null   int64
 2   K            4000 non-null   int64
 3   temperature  4000 non-null   float64
 4   humidity     4000 non-null   float64
 5   ph           4000 non-null   float64
 6   rainfall     4000 non-null   float64
 7   label        4000 non-null   object
dtypes: float64(4), int64(3), object(1)
memory usage: 250.1+ KB

In [13]:
df_yield.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3000 entries, 0 to 2999
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   State            3000 non-null   object
 1   Crop             3000 non-null   object
 2   Season           3000 non-null   object
 3   Area             3000 non-null   float64
 4   Annual_Rainfall  3000 non-null   float64
 5   Fertilizer       3000 non-null   float64
 6   Yield            3000 non-null   float64
dtypes: float64(4), object(3)
memory usage: 164.2+ KB

In [14]:
df_crop.isnull().sum()

N              0
P              0
K              0
temperature    0
humidity       0
ph             0
rainfall       0
label          0
dtype: int64

In [15]:
df_yield.isnull().sum()

State              0
Crop               0
Season             0
Area               0
Annual_Rainfall    0
Fertilizer         0
Yield              0
dtype: int64

In [16]:
df_crop.duplicated().sum()

np.int64(0)

In [17]:
df_yield.duplicated().sum()

np.int64(0)

In [18]:
df_crop.describe()

,N,P,K,temperature,humidity,ph,rainfall
count,4000.000000,4000.000000,4000.000000,4000.000000,4000.000000,4000.000000,4000.000000
mean,70.873250,42.554750,42.121250,24.238478,63.281798,6.426988,128.428262
std,23.157726,9.450943,10.662386,4.001079,12.400519,0.637933,76.541704
min,20.000000,20.000000,20.000000,10.060000,30.010000,4.500000,30.290000
25%,55.000000,36.000000,34.000000,21.570000,54.457500,6.060000,68.322500
50%,69.500000,43.000000,42.000000,24.370000,63.525000,6.430000,99.300000
75%,85.000000,49.000000,50.000000,27.150000,71.970000,6.880000,184.002500
max,139.000000,59.000000,69.000000,34.990000,89.990000,7.990000,349.070000

In [19]:
df_yield.describe()

              Area  Annual_Rainfall   Fertilizer        Yield
count  3000.000000      3000.000000  3000.000000  3000.000000
mean     10.436383      1650.865833   193.489030    45.918193
std       5.597383       785.167801    91.130707    14.486371
min       0.510000       300.490000    40.040000    14.330000
25%       5.580000       977.332500   112.247500    37.140000
50%      10.550000      1647.135000   193.430000    43.750000
75%      15.222500      2360.205000   273.172500    50.902500
max      20.000000      2997.550000   349.990000   108.800000